cats = [('Мартин', 5, 'Алексей', 'Егоров'),
      ('Фродо', 3, 'Анна', 'Самохина'),
      ('Вася', 4, 'Андрей', 'Белов'),
      ('Муся', 7, 'Игорь', 'Бероев'),
      ('Изольда', 2, 'Игорь', 'Бероев'),
      ('Снейп', 1, 'Марина', 'Апраксина'),
      ('Лютик', 4, 'Виталий', 'Соломин'),
      ('Снежок', 3, 'Марина', 'Апраксина'),
      ('Марта', 5, 'Сергей', 'Колесников'),
      ('Буся', 12, 'Алена', 'Федорова'),
      ('Джонни', 10, 'Игорь', 'Андропов'),
      ('Мурзик', 1,'Марина', 'Апраксина'),
      ('Барсик', 2, 'Анна', 'Самохина'),
      ('Рыжик', 7, 'Владимир', 'Медведев'),
        ('Матильда', 8, 'Андрей', 'Белов'),
      ('Гарфилд', 3, 'Александр', 'Березуев')]
dict = {}
for cat in cats:
      nickname_age =  cat[0] + ',' + str(cat[1])
      dict.setdefault(cat[2:], []).append((nickname_age))
for owner, animals in dict.items():
	print(' '.join(owner) + ':', '; '.join(animals))




